#+STARTUP: nologdone nologrepeat nolognoteclock-out nologreschedule nologredeadline nologrefile
#+TODO: TODO(t) | DONE(d)
#+TODO: PLAN(r) | PROJ(p)
#+TODO: | CNCL(c)
* DONE add validation that every nixos module in modules/ has proper ~key~
* CNCL Closure size tracking (with git notes?)
* TODO `just lint` - remove check, convert to pre-commit hook, ???
* DONE Explain why explicit key is needed
* TODO tpm2-pkcs11-esapi FTW
* TODO configure treefmt / pre-commit hooks - for nix, ansible, terraform
* TODO build-all - support remote-only builds
  --builders 'ssh://nix-cache x86_64-linux /home/binarin/.ssh/id_ed25519 16 1 big-parallel' --max-jobs 0
* TODO connect desktop nix machines to proxmox backup server
  :PROPERTIES:
  :ID: aee8dfaa-6081-439c-b3ec-1df5765e3aa7
  :CREATED: [2025-12-01 Mon 09:38]
  :END:
  :CLOCK:
  CLOCK: [2025-12-01 Mon 09:38]--[2025-12-01 Mon 09:39] =>  0:01
  :END:
* TODO surface broken RTC - add backstop, early in stage-2 boot
  :PROPERTIES:
  :ID: 33c0e58f-bf97-4975-b63f-7bcfc4d2c418
  :CREATED: [2025-12-01 Mon 09:37]
  :END:
  :CLOCK:
  CLOCK: [2025-12-01 Mon 09:37]--[2025-12-01 Mon 09:38] =>  0:01
  :END:
* TODO smb-sketchup like share for valak vms
  :PROPERTIES:
  :ID: 8bde76c6-05cf-4c65-88ab-97c68d391e1f
  :CREATED: [2025-11-27 Thu 17:22]
  :END:
* TODO Script to rolling upgrade all deploy_rs machines
  :PROPERTIES:
  :ID: 25507817-4383-4a0d-8234-ecc01264c6be
  :CREATED: [2025-12-01 Mon 19:33]
  :END:
  :CLOCK:
  CLOCK: [2025-12-01 Mon 19:33]--[2025-12-01 Mon 19:34] =>  0:01
  :END:
* TODO Adding new machine

mkdir -p ./secrets/claude-nixos-config/etc/ssh
ssh-keygen -A -f ./secrets/claude-nixos-config/
mv -v ./secrets/claude-nixos-config/etc/ssh/* ./secrets/claude-nixos-config/
sops encrypt -i secrets/claude-nixos-config/ssh_host_ecdsa_key
sops encrypt -i secrets/claude-nixos-config/ssh_host_ed25519_key
sops encrypt -i secrets/claude-nixos-config/ssh_host_rsa_key

age-keygen -o secrets/claude-nixos-config/user-binarin-age # XXX remember public key here instead of decrypt
sops encrypt -i secrets/claude-nixos-config/user-binarin-age
user_claude_nixos_config=$(age-keygen -y <(sops decrypt secrets/claude-nixos-config/user-binarin-age)))
serve_claude_nixosd-config=$(ssh-to-age < ./secrets/claude-nixos-config/ssh_host_ed25519_key.pub)

add 2 keys in .sops.yaml
add secrets.yaml / user-binarin.yaml stanzas in .sops.yaml


if impermanence:
fileSystems."/persist".neededForBoot = true;
fileSystems."/local".neededForBoot = true;

self.nixosModules.systemd-boot

drop iso from proxmox vm

flake.deploy.nodes.claude-nixos-config = {
